tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/hotRoom/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    floor
    {
        type            wall;
        nFaces          400;
        startFace       11200;
    }
    ceiling
    {
        type            wall;
        nFaces          400;
        startFace       11600;
    }
    fixedWalls
    {
        type            wall;
        nFaces          800;
        startFace       12000;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
