tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/hotRoom/0/U
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floor           
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ceiling         
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWalls      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
