tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/hotRoom/0/epsilon
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    floor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    ceiling
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    fixedWalls
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
